#!/usr/bin/env bash
    #=
    exec julia --project="$(realpath $(dirname $0))" --color=yes --startup-file=no -e "include(popfirst!(ARGS))" \
    "${BASH_SOURCE[0]}" "$@"
    =#

# Testing

include(joinpath(dirname(dirname(@__FILE__)), "src", "ComputabilityTheory.jl"))

using .ComputabilityTheory
using Test

@testset "ComputabilityTheory.jl" begin

    pair_tuple(5,7) == 83
    pair_tuple(5,7,20) == 5439
    pair_tuple([1,2,3,4,5,6,7,8,9]...) == 131504586847961235687181874578063117114329409897615188504091716162522225834932122128288032336298131
    
    π(83, 2) == (5,7)
    π(83, 2, 0) == 5
    π(83, 3) == (2, 0, 7)
    π(1023, 2, 1) == 11
    π(big(1315045868479612356871818745780631171143), 1) == 1315045868479612356871818745780631171143
    π(5987349857934, 0) == nothing
    π(83, 3, algebraic) == (2, 0, 7)
    π(10001, 10, algebraic) == (0, 0, 0, 0, 0, 0, 1, 3, 4, 9)
    π(big(1315045868479612356871818745780631171143), 1, algebraic) == 1315045868479612356871818745780631171143
    π(5987349857934, 0, algebraic) == nothing
    small_random = abs(rand(1:100))
    large_random = abs(rand(1:10000))
    π(small_random, 3, algebraic) == π(small_random, 3)
    π(large_random, 2, algebraic) == π(large_random, 2)
    π(972292871301644916468488152875266508938968846389326007980307063346008398713128885682044504108288931767348821063618087715644933567266540511345568504718733339523678538338052787779884557674350959673597803113281693069940562881722205193604550737455583875504348606989700013337656597740101535, algebraic) == (7, 44097457325828774284791367377726710860393112311607949541420228252579855118277296197320694764257474575167892495444390648066046785424108252105160)
    # @test π(rand(1:10^1000), algebraic)
    
    cℤ([0,-1,1,-2,2,-3,3,-4,4]) == [0, 1, 2, 3, 4, 5, 6, 7, 8]
    cℤ((-1,2)) == 16
    cℤ((1,1)) == 12
    cℤ(3,4) == (6, 8)
    
    cℤ⁻¹([0, 1, 2, 3, 4, 5, 6, 7, 8]) == [0, -1, 1, -2, 2, -3, 3, -4, 4]
    cℤ(cℤ⁻¹(79)) == 79
    cℤ⁻¹(cℤ(-40)) == -40
    cℤ⁻¹(10029) == -5015

### PROGRAMME
	occursin(r"0[[:space:]]*halt", show_programme(121))

### INSTRUCTIONS
	@test Instruction(7).instruction == (1, 2)
	@test Instruction((3, (1, 2))) == 58

end # end testset
